--그룹별 검색
--주문테이블에서 주문고객별 주문한 제품의 총주문수량을 검색하시오.

select 주문고객, sum(수량) as 총주문수량 from 주문
        group by 주문고객;
--주문테이블에서 각 주문고객이 주문한 제품의 총주문수량을 주문제품별로 검색하시오.
select 주문제품, 주문고객, sum(수량) as 총주문수량 from 주문
        group by 주문제품, 주문고객
        order by 주문제품;
        
--조인(join) 검색
--주문, 제품테이블 조인(부모테이블의 외래키(FK)와 자식테이블의 기본키(PK) 속성)
--주문테이블과 제품테이블을 조인검색하시오.
select * from 주문, 제품
       where 주문제품 = 제품번호;
       
--주문테이블과 제품테이블을 조인검색하시오.(주문번호, 주문고객, 제품명, 단가, 제조업체 만 출력)
select 주문번호, 주문고객, 제품명, 단가, 제조업체 from 주문, 제품
       where 주문제품 = 제품번호;
       
--주문테이블과 제품, 고객 테이블을 조인검색하시오.(주문번호, 주문고객, 고객이름, 제품명, 단가, 수량, 제조업체 만 출력) 
select 주문번호, 주문고객, 고객이름, 제품명, 단가, 수량, 제조업체 from 주문, 제품, 고객
       where 주문제품 = 제품번호 and 주문고객= 고객아이디;
       
--apple 고객이 주문한 제품의 이름을 검색하시오.
select 제품명 from 제품,주문
     where 주문제품=제품번호 and 주문고객='apple';
--감자만두를 주문한 고객의 이름을 검색하시오.
select 고객이름 from 제품,고객,주문
     where 주문제품=제품번호 and 고객아이디=주문고객 and 제품명='감자만두';